; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v2 - type_2 ?v8 - type_3)
 	      (pred_4 ?v4 - object ?v8 - type_3)
	      (pred_1 ?v2 - type_2 ?v3 - type_1)
	      (pred_2 ?v2 - type_2 ?v4 - object ?v3 - type_1))

   (:action op_2
       :parameters  (?v2 - type_2 ?v7 ?v5 - type_3)
       :precondition (and  (pred_3 ?v2 ?v7))
       :effect (and  (pred_3 ?v2 ?v5)
		     (not (pred_3 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_2 ?v1 - object ?v6 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v6) (pred_3 ?v2 ?v6) (pred_1 ?v2 ?v3))
       :effect (and (pred_2 ?v2 ?v1 ?v3)
		    (not (pred_4 ?v1 ?v6)) 
		    (not (pred_1 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_2 ?v1 - object ?v6 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v1 ?v3) (pred_3 ?v2 ?v6))
       :effect (and (pred_4 ?v1 ?v6)
		    (pred_1 ?v2 ?v3)
		    (not (pred_2 ?v2 ?v1 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_07 - type_2
obj_06 obj_05 obj_01 obj_09 - type_1
obj_03 obj_13 obj_02 obj_12 - type_3
obj_08 obj_04 obj_10 obj_14 - object)
(:init
(pred_3 obj_11 obj_12)
(pred_1 obj_11 obj_06)
(pred_1 obj_11 obj_05)
(pred_3 obj_07 obj_02)
(pred_1 obj_07 obj_01)
(pred_1 obj_07 obj_09)
(pred_4 obj_08 obj_03)
(pred_4 obj_04 obj_02)
(pred_4 obj_10 obj_02)
(pred_4 obj_14 obj_13)
)
(:goal
(and
(pred_4 obj_08 obj_02)
(pred_4 obj_04 obj_02)
(pred_4 obj_10 obj_03)
(pred_4 obj_14 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_11 obj_02)))
)
)

; plan
1. (op_1 obj_07 obj_10 obj_02 obj_09)
   deleted: (pred_4 obj_10 obj_02) (pred_1 obj_07 obj_09)
   added: (pred_2 obj_07 obj_10 obj_09)
   goals met: 1 of 4
2. (op_2 obj_11 obj_12 obj_13)
   deleted: (pred_3 obj_11 obj_12)
   added: (pred_3 obj_11 obj_13)
   goals met: 1 of 4
3. (op_2 obj_07 obj_02 obj_03)
   deleted: (pred_3 obj_07 obj_02)
   added: (pred_3 obj_07 obj_03)
   goals met: 1 of 4
4. (op_1 obj_11 obj_14 obj_13 obj_05)
   deleted: (pred_4 obj_14 obj_13) (pred_1 obj_11 obj_05)
   added: (pred_2 obj_11 obj_14 obj_05)
   goals met: 1 of 4
5. (op_2 obj_11 obj_13 obj_12)
   deleted: (pred_3 obj_11 obj_13)
   added: (pred_3 obj_11 obj_12)
   goals met: 1 of 4
6. (op_3 obj_07 obj_10 obj_03 obj_09)
   deleted: (pred_2 obj_07 obj_10 obj_09)
   added: (pred_4 obj_10 obj_03) (pred_1 obj_07 obj_09)
   goals met: 2 of 4
7. (op_1 obj_07 obj_08 obj_03 obj_01)
   deleted: (pred_4 obj_08 obj_03) (pred_1 obj_07 obj_01)
   added: (pred_2 obj_07 obj_08 obj_01)
   goals met: 2 of 4
8. (op_2 obj_07 obj_03 obj_02)
   deleted: (pred_3 obj_07 obj_03)
   added: (pred_3 obj_07 obj_02)
   goals met: 2 of 4
9. (op_3 obj_11 obj_14 obj_12 obj_05)
   deleted: (pred_2 obj_11 obj_14 obj_05)
   added: (pred_4 obj_14 obj_12) (pred_1 obj_11 obj_05)
   goals met: 3 of 4
10. (op_3 obj_07 obj_08 obj_02 obj_01)
   deleted: (pred_2 obj_07 obj_08 obj_01)
   added: (pred_4 obj_08 obj_02) (pred_1 obj_07 obj_01)
   goals met: 4 of 4
